In [7]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'], 
    'age': [25, 8, 48], 
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
})
df

     name  age          job  salary
0    Маша   25  Программист     100
1    Вася    8     Школьник      10
2  Эдуард   48     Big Boss     200

In [9]:
name = df["name"]
name

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [10]:
df[df["salary"] >= 100]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big Boss     200

In [11]:
df["salary"] *= 10
df

     name  age          job  salary
0    Маша   25  Программист    1000
1    Вася    8     Школьник     100
2  Эдуард   48     Big Boss    2000

In [13]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'], 
    'age': [25, 8, 48], 
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
}, index = ['some', 'random', 'words'])
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [14]:
df.loc['some':'random']

        name  age          job  salary
some    Маша   25  Программист     100
random  Вася    8     Школьник      10

In [15]:
df.iloc[-1]

name        Эдуард
age             48
job       Big Boss
salary         200
Name: words, dtype: object

* Транспонирование (переворачиваем столбы - удобно, когда их много)

In [16]:
df.T

               some    random     words
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big Boss
salary          100        10       200